clc;clear;
% Ch2-2
% 2023/10/1
%------------------------------------------------------------------------
% 计算P(x)各系数的值（a0至a9）
% syms x;   % 将x设为变量
% px=(x-1)*(x-2)*(x-3)*(x-4)*(x-5)*(x-6)*(x-7)*(x-8)*(x-9)*(x-10);% 列出px
% expand(px)    % 将px展开

x=[1,-1];
for i=2:10
    xi=[1,-i];
    x=conv(x,xi);   % 卷积
end
% disp(x)
%-------------------------------------------------------------------------
% 比较分析不同扰动对计算方程根的影响
x_6=x;x_8=x;x_10=x;
x_6(11)=x_6(11)+10^-6;  % 添加相应的扰动
x_8(11)=x_8(11)+10^-8;
x_10(11)=x_10(11)+10^-10;
r=roots(x); % 未添加扰动时方程的根
r_6=roots(x_6); % 添加扰动后方程的根
r_8=roots(x_8);
r_10=roots(x_10);

rc_6=abs(r_6-r)./10^-9; % 计算添加扰动后相对误差的大小
rc_8=abs(r_8-r)./10^-9;
rc_10=abs(r_10-r)./10^-9;
