clear;clc;
% 数值分析
% Ch6-上机题
% 拉格朗日插值计算

L10_4p8=Lagrange(4.8,10);   % x=4.8处10项拉格朗日插值函数计算值
L20_4p8=Lagrange(4.8,20);   % x=4.8处20项拉格朗日插值函数计算值
f4p8=1/(1+4.8^2);   % x=4.8处非插值函数计算值
e10_4p8=L10_4p8-f4p8    % x=4.8处10项拉格朗日插值函数误差值
e20_4p8=L20_4p8-f4p8    % x=4.8处20项拉格朗日插值函数误差值

function L=Lagrange(x,n)
% x是输入的x的值;n是拉格朗日函数的阶数
    h=10/n; % 步长
    xi=zeros(n+1);   % 插值计算中各节点的x值
    for i=1:n+1 % 计算各节点的值
        xi(i)=-5+(i-1)*h;
    end
    yi=1./(1+xi.^(2));  % 计算各节点的y值

    L=0;
    for j=1:n+1
        t=1;
        for k=1:n+1
            if k~=j
                t=t*(x-xi(k))/(xi(j)-xi(k));    % 拉格朗日插值函数每个节点
            end
        end
        L=L+yi(j)*t;    % 插值节点相加
    end
end